stm32-rs/stm32l0xx-hal/src/adc.rs
//! # Analog to Digital converter


use core::{
    ops::DerefMut,
    pin::Pin,
    sync::atomic::{
        compiler_fence,
        Ordering,
    },
    fmt,
};

use as_slice::AsMutSlice;

use crate::{
    gpio::*,
    hal::adc::{Channel, OneShot},
    pac::ADC,
    rcc::Rcc,
};

use crate::dma::{
    self,
    Buffer as _,
};


pub trait AdcExt {
    fn constrain(self, rcc: &mut Rcc) -> Adc<Ready>;
}

impl AdcExt for ADC {
    fn constrain(self, rcc: &mut Rcc) -> Adc<Ready> {
        Adc::new(self, rcc)
    }
}


/// ADC Result Alignment
#[derive(PartialEq)]
pub enum Align {
    /// Right aligned results (least significant bits)
    ///
    /// Results in all precisions returning values from 0-(2^bits-1) in
    /// steps of 1.
    Right,
    /// Left aligned results (most significant bits)
    ///
    /// Results in all precisions returning a value in the range 0-65535.
    /// Depending on the precision the result will step by larger or smaller
    /// amounts.
    Left,
}

/// ADC Sampling Precision
#[derive(Copy, Clone, PartialEq)]
pub enum Precision {
    /// 12 bit precision
    B_12 = 0b00,
    /// 10 bit precision
    B_10 = 0b01,
    /// 8 bit precision
    B_8 = 0b10,
    /// 6 bit precision
    B_6 = 0b11,
}

/// ADC Sampling time
#[derive(Copy, Clone, PartialEq)]
pub enum SampleTime {
    /// 1.5 ADC clock cycles
    T_1_5 = 0b000,

    /// 3.5 ADC clock cycles
    T_3_5 = 0b001,

    /// 7.5 ADC clock cycles
    T_7_5 = 0b010,

    /// 12.5 ADC clock cycles
    T_12_5 = 0b011,

    /// 19.5 ADC clock cycles
    T_19_5 = 0b100,

    /// 39.5 ADC clock cycles
    T_39_5 = 0b101,

    /// 79.5 ADC clock cycles
    T_79_5 = 0b110,

    /// 160.5 ADC clock cycles
    T_160_5 = 0b111,
}

/// Analog to Digital converter interface
pub struct Adc<State> {
    rb: ADC,
    sample_time: SampleTime,
    align: Align,
    precision: Precision,
    _state: State,
}

impl Adc<Ready> {
    pub fn new(adc: ADC, rcc: &mut Rcc) -> Self {
        // Enable ADC clocks
        rcc.rb.apb2enr.modify(|_, w| w.adcen().set_bit());
        adc.cr.modify(|_, w| w.advregen().set_bit());

        Self {
            rb: adc,
            sample_time: SampleTime::T_1_5,
            align: Align::Right,
            precision: Precision::B_12,
            _state: Ready,
        }
    }

    /// Set the Adc sampling time
    pub fn set_sample_time(&mut self, t_samp: SampleTime) {
        self.sample_time = t_samp;
    }

    /// Set the Adc result alignment
    pub fn set_align(&mut self, align: Align) {
        self.align = align;
    }

    /// Set the Adc precision
    pub fn set_precision(&mut self, precision: Precision) {
        self.precision = precision;
    }

    
    /// Starts a continuous conversion process
    ///
    /// The `channel` argument specifies which channel should be converted.
    ///
    /// The `trigger` argument specifies the trigger that will start each
    /// conversion sequence. This only configures the ADC peripheral to accept
    /// this trigger. The trigger itself must also be configured using its own
    /// peripheral API.
    ///
    /// In addition to the preceeding arguments that configure the ADC,
    /// additional arguments are required to configure the DMA transfer that is
    /// used to read the results from the ADC:
    /// - `dma` is a handle to the DMA peripheral.
    /// - `dma_chan` is the DMA channel used for the transfer. It needs to be
    ///   one of the channels that supports the ADC peripheral.
    /// - `buffer` is the buffer used to buffer the conversion results.
    ///
    /// # Panics
    ///
    /// Panics, if `buffer` is larger than 65535.
    pub fn start<DmaChan, Buf>(mut self,
        channels: impl Into<Channels>,
        trigger:  Option<Trigger>,
        dma:      &mut dma::Handle,
        dma_chan: DmaChan,
        buffer:   Pin<Buf>,
    )
        -> Adc<ActiveContinuousDMA<DmaChan, Buf>>
        where
            DmaToken:    dma::Target<DmaChan>,
            Buf:         DerefMut + 'static,
            Buf::Target: AsMutSlice<Element=u16>,
            DmaChan:     dma::Channel,
    {
        // The ADC can support only one DMA transfer at a time, so only one of
        // these DMA tokens must exist at a time. We guarantee this by only
        // creating it in this method, that can only be called in the ADC's
        // `Ready` state. The DMA transfer is ended and the token associated
        // with it is dropped before we return to the `Ready` state.
        let dma_token = DmaToken(());

        let num_words = (*buffer).len();

        // Safe, because we're only taking the address of a register.
        let address = &self.rb.dr as *const _ as u32;

        // The cast to `u16` could truncate the value, but if it does,
        // `Transfer::new` is going to panic anyway.
        let buffer_unsafe = Buffer {
            ptr: buffer.as_ptr(),
            len: buffer.len() as u16,
            pos: 0,

            r_gt_w: false,
        };

        // Safe, because the trait bounds of this method guarantee that the
        // buffer can be written to.
        let transfer =
            unsafe {
                dma::Transfer::new(
                    dma,
                    dma_token,
                    dma_chan,
                    buffer,
                    num_words,
                    address,
                    dma::Priority::high(),
                    dma::Direction::peripheral_to_memory(),
                    true,
                )
            }
            .start();

        let continous = trigger.is_none();

        self.power_up();
        self.configure(channels, continous, trigger);
	self.start_conversion();
        Adc {
            rb:          self.rb,
            sample_time: self.sample_time,
            align:       self.align,
            precision:   self.precision,
            _state:      ActiveContinuousDMA { buffer: buffer_unsafe, transfer },
        }
    }

    /// Prepare ADC for use with DMA
    ///
    /// The `channel` argument specifies which channels should be converted.
    ///
    /// The `trigger` argument specifies the trigger that will start each
    /// conversion sequence. This only configures the ADC peripheral to accept
    /// this trigger. The trigger itself must also be configured using its own
    /// peripheral API.
    ///
    /// In addition to the preceeding arguments that configure the ADC,
    /// additional arguments are required to configure the DMA transfer that is
    /// used to read the results from the ADC:
    /// - `dma_chan` is the DMA channel used for the transfer. It needs to be
    ///   one of the channels that supports the ADC peripheral.
    pub fn with_dma<DmaChan, AdcChan>(mut self,
        channel: AdcChan,
        trigger:  Option<Trigger>,
        dma_chan: DmaChan,
    )
        -> Adc<ReadyOneShotDMA<DmaChan, AdcChan>>
        where
            AdcChan:     Channel<Adc<Ready>, ID = u8>,
    {



        let continous = trigger.is_none();

        self.power_up();
	let channels = Channels { flags: 0x1 << AdcChan::channel() };
        self.configure(channels, continous, trigger);

        Adc {
            rb:          self.rb,
            sample_time: self.sample_time,
            align:       self.align,
            precision:   self.precision,
            _state:      ReadyOneShotDMA { adc_chan: channel, dma_chan },
        }
    }
}



impl<DmaChan, Buffer> Adc<ActiveContinuousDMA<DmaChan, Buffer>>
    where DmaChan: dma::Channel,
{
    /// Returns an iterator over all currently available values
    ///
    /// The iterator iterates over all buffered values. It returns `None`, once
    /// the end of the buffer has been reached.
    pub fn read_available(&mut self)
        -> Result<impl Iterator<Item=Result<u16, Error>> + '_, Error>
    {
        if self.rb.isr.read().ovr().is_overrun() {
            self.rb.isr.write(|w| w.ovr().clear());
            return Err(Error::AdcOverrun);
        }

        Ok(
            ReadAvailable {
                buffer:   &mut self._state.buffer,
                transfer: &mut self._state.transfer,
            }
        )
    }
}

impl<DmaChan, AdcChan> Adc<ReadyOneShotDMA<DmaChan, AdcChan>> {
    /// start a dma conversion sequence into the given buffer
    pub fn read_all<Buf>(self, dma: &mut dma::Handle, buffer: Pin<Buf>) -> Adc<ActiveOneShotDMA<DmaChan, AdcChan, Buf>>
    where
	DmaToken:    dma::Target<DmaChan>,
        Buf:         DerefMut + 'static,
        Buf::Target: AsMutSlice<Element=u16>,
        DmaChan:     dma::Channel,
        AdcChan:     Channel<Adc<Ready>, ID = u8>,
    {
	// The ADC can support only one DMA transfer at a time, so only one of
        // these DMA tokens must exist at a time. We guarantee this by only
        // creating it in this method, that can only be called in the ADC's
        // `Ready` state. The DMA transfer is ended and the token associated
        // with it is dropped before we return to the `Ready` state.
        let dma_token = DmaToken(());

        let num_words = (*buffer).len();

        // Safe, because we're only taking the address of a register.
        let address = &self.rb.dr as *const _ as u32;


        // Safe, because the trait bounds of this method guarantee that the
        // buffer can be written to.
        let transfer =
            unsafe {
                dma::Transfer::new(
                    dma,
                    dma_token,
                    self._state.dma_chan,
                    buffer,
                    num_words,
                    address,
                    dma::Priority::high(),
                    dma::Direction::peripheral_to_memory(),
                    true,
                )
            }
            .start();

	
        let mut new_adc = Adc {
            rb:          self.rb,
            sample_time: self.sample_time,
            align:       self.align,
            precision:   self.precision,
            _state:      ActiveOneShotDMA { adc_chan: self._state.adc_chan, transfer },
        };

